{
    "1": [
        "1-camera awesome  2- battery 🔋 better performance 3- processor best performance  4-speaker okk 5-Display awesome 6-mobile design super❤❤❤❤ Overall redmi note 12 is too good and valuable for money 💕💕💕💕💕💕👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌"
    ],
    "2": [
        "Mobile look wise is awesome and display is good and battery is good but performance wise it's not good and the sound quality is also poor."
    ],
    "3": [
        "Redmi mobile all note series to good. Redmi note 12 so nice all rounder 4g smart phone. But camera only good. So improve camera section. Thanks to flipcart lowest price and exchange policy. To good. Thnks flipcart."
    ],
    "4": [
        "What a design , Just killer design , battery good , charging speed good , display is top notch 👌🏻👌🏻👌🏻👌🏻 just liked the device , very much . 4 star out of 5 star 🌟🌟🌟🌟"
    ],
    "5": [
        "Giving review post use 2days  1 - Camera quality Awesome. You can zoom the picture which I post and can check the quality. Even skin cells also visible clearly if you take snap in 50mp 2 - Battery quality is good. Post full charge getting 1.5 days service.  3 - Design cool look. Colour also very nice.  4 - Touch screen performance also very good.  I am Happy. I got what I expected. 👍"
    ],
    "6": [
        "Many people have enjoyed running this Redmi phone and it is very good this fon is Amazing👍😍👍 and very very good this mobile and so fust raning this fone and quick charge mobile"
    ],
    "7": [
        "Redmi note 12 4G very good phone latest version Android 13 Miui 14 virgin super amoled display video performance very good processor Snapdragon 685 very smooth experience Flipkart delivery very fast 2 working days and mobile is okay mobile charger 33 watt 0 to 100% battery charge up to 1 hour 10 minute battery backup 100 to 0% battery drain 13 hour very good battery backup Thanks Flipkart team 💯👌👌"
    ],
    "8": [
        "I'm thoroughly impressed with this phone. The sleek design and vibrant display make it a joy to use. The camera quality is amazing and captures stunning photos even in low light settings. It's also equipped with a long-lasting battery that can easily last a full day on a single charge, which is extremely convenient for someone who is always on the go.  One of the standout features of this phone is its fast and efficient performance. Apps open quickly and run smoothly without any lag or delay...."
    ],
    "9": [
        "Review after 1 week usage..  Nice phone... Complete satisfaction..   Pros- Nice front camera so good quality pics, Battery long last for 1 to 2 days..  slim and light weight,  nice features, trusted brand as usual..   Cons: No 5g support, battery charting takes more than 2hrs to get 100% fully charged. Price is more compared to other brands"
    ],
    "10": [
        "Feels premium and decent weight to handle."
    ],
    "11": [
        "Quality is good"
    ],
    "12": [
        "Nice mobile for this price"
    ],
    "13": [
        "Nice product"
    ],
    "14": [
        "Amazing camera phone  Battery also good"
    ],
    "15": [
        "Everything is perfect Except Camera. (CAMERA is not fully optimised with this new SD 685) Suggestion: Use GCam you will get almost perfect snap ( 3x better than stock camera on this phone)"
    ],
    "16": [
        "Good to use 👍"
    ],
    "17": [
        "Not Bad 👍"
    ],
    "18": [
        "Camera is not good as expected in price range"
    ],
    "19": [
        "This phone is so good.i also use redmi phones And this is the dest.😇😇"
    ],
    "20": [
        "Good picture and good performance"
    ],
    "21": [
        "Worst camera ever.. Not value for money. Totally wasted"
    ],
    "22": [
        "Product is nice by design and many more features but the camera quality is poor at this price except camera the mobile is best."
    ],
    "23": [
        "Camera decent hn Display awesome👍 Design superb👌 Processor amazing😍 Over all value for money 💯"
    ],
    "24": [
        "The camera is third class (front +back). Don't buy this phone. SAMSUNG is the best phone for me."
    ],
    "25": [
        "Camera quality very bad"
    ],
    "26": [
        "All specs is good"
    ],
    "27": [
        "Review after 5 days of usage: Pros:  Sleek design Good battery backup Less charging time (45-50) mins for 30%-100% Cons:  Pathetic camera setup - Front cam is really pathetic considering the price point of 15k Back camera is also below average. Color reproduction is pathetic. I had to edit the pic every time to make it look natural every time. Display- visible difference is there when switching to 120hz refresh rate, but the basic color temperature of the display is with a tint and that canno..."
    ],
    "28": [
        "Super quality"
    ],
    "29": [
        "Nice"
    ],
    "30": [
        "LOVELY PHONE GOOD AND BEST DISPLY AND DESIGN ..!!⚡💎"
    ],
    "31": [
        "Good product"
    ],
    "32": [
        "camera having low quality, not satisfied"
    ],
    "33": [
        "Product is nice,,camera quality is good,,sound quality is very good,,thanx flipkart"
    ],
    "34": [
        "Mobile is good, but camera quality very bad 😔"
    ],
    "35": [
        "For this amount, quality is too low."
    ],
    "36": [
        "Nice looking and quality and performance in this product and price"
    ],
    "37": [
        "Camera and video poor quality. Don't by redme note 12.  Redme note 7 pro camera quality excellent. compare with redme note 12 . Red me note 12 worest camera performance. I purched note 7 pro  4 year back super perpomence, but red me note 12 camera performance worest,"
    ],
    "38": [
        "I am completely satisfied with this... Camera is not up to the mark...But overall I like redmi devices.. Thanks Xiaomi ❤️"
    ],
    "39": [
        "This phone is really good..."
    ],
    "40": [
        "excellent boxy design... nice display... 1200 nits... 120 refresh rate super.."
    ],
    "41": [
        "Ok"
    ],
    "42": [
        "Don't waste your money buying these things. The fitting on the side of the phone is also not right. And the quality of the camera is not as good as it should be in 50 mega pixel."
    ],
    "43": [
        "Camera 📷 quality good 👍. Nice performance"
    ],
    "44": [
        "Overall is value for money phone"
    ],
    "45": [
        "As like Redmi"
    ],
    "46": [
        "Camera not good"
    ],
    "47": [
        "The display is not good, it's a Super Amoled but it not deep black When you test the black screen in the night it's saw you deem/flicker light on the hole display ."
    ],
    "48": [
        "Nice"
    ],
    "49": [
        "Top"
    ],
    "50": [
        "Good 4G Mobile Display Good Fast processor 2.8 GHz But Delay Screen lacks 60 hz please update Good multimedia Experience"
    ],
    "51": [
        "That's a very good product 🫶🫶"
    ],
    "52": [
        "Camera is worst rest all okk okk"
    ],
    "53": [
        "Phone is good but camera doesn't worthy to value"
    ],
    "54": [
        "Camera very poor quality at this price range. third class camera . And battery Backup not good.   Don't buy This Phone . Totally west money"
    ],
    "55": [
        "Battery is completing Early  Camera is not Good just average  Mobile is very slow comparing with note 9 pro max  Mobile look is awesome  Display is Good  Just average"
    ],
    "56": [
        "Camera is worst in this price range, very disappointed, Finger print scanner response is delay  Screen lacks in 60 hz , while scrolling,"
    ],
    "57": [
        "Pros 1. Slim and light weight 2. Good Display 3. Good Battery  Cons 1. Poor Camera 2. Low Sound  Flipkart Experience  1. Worst exchange policy.  My existing phone picked up very low price.  I paid extra 1750rs from my pocket for very minor issues. Poor customer support . They are not at all helping.  2. Don't know what is point of charging pick up charge 150 rs and packing fee 50rs"
    ],
    "58": [
        "Best looking mobile in this price  Good display"
    ],
    "59": [
        "Very nice pic 🖼️"
    ],
    "60": [
        "Amazing phone"
    ],
    "61": [
        "Cost wise less sensible product. Rear camera quality not up to the mark."
    ],
    "62": [
        "1) performance good 2) camera very good 3) display excellent 4) battery excellent 5) sounds ok 6) design premium look. And feel."
    ],
    "63": [
        "Best performance Light weight Good couler"
    ],
    "64": [
        "Very nice look...Awesome"
    ],
    "65": [
        "Redmi note 12 4g value money but 4g u can buy 5g mobile Camera ok not bad Battery 🔋 average Display awesome"
    ],
    "66": [
        "Tooo Flipcort unable too reach customer expectations I had bad experience with customer service. After look after this product have change with vivo products bt Flipcort service gave bad service still I can't exchange with other"
    ],
    "67": [
        "So cute 🥰🥰"
    ],
    "68": [
        "Exlent mobile"
    ],
    "69": [
        "The product is very nice"
    ],
    "70": [
        "Super ❤"
    ],
    "71": [
        "Overall note 12 is ok. But Camera lacks quality a lot. Clicks very poor quality pictures . There are better 5g phones available in this price range. Consider this phone as your last option. Hope Mi fix this issue through update"
    ],
    "72": [
        "Camera is very poor"
    ],
    "73": [
        "Not like it"
    ],
    "74": [
        "Camera is very poor quality"
    ],
    "75": [
        "Good"
    ],
    "76": [
        "Waste for money"
    ],
    "77": [
        "Very Good Phone"
    ],
    "78": [
        "Really good 👍 but camera is not good battery ok"
    ],
    "79": [
        "good at its range"
    ],
    "80": [
        "good"
    ],
    "81": [
        "Jast awesome Product...."
    ],
    "82": [
        "Overall phone is good but camera was not up to the mark"
    ],
    "83": [
        "Very beautiful"
    ],
    "84": [
        "Okay It's awesome👍👏😊"
    ],
    "85": [
        "Excellent display, stunning design, beautiful look. The sound quality is disappointing and camera too not as expected."
    ],
    "86": [
        "Please Don't buy this mobile  camera are very worst quality  Display resolution is not good for the price"
    ],
    "87": [
        "Value for money"
    ],
    "88": [
        "Battery drain very fast Camera not good Display ok  I bought redmi because I thought here I will not get, glance and all third party app like realme, Please go for stock Android, otherwise these third party app, glance will irritate you"
    ],
    "89": [
        "Very nice"
    ],
    "90": [
        "Redmi note 12 super battery backup 5000 charger mobile 33 super 🥰😍🤩🥳"
    ],
    "91": [
        "Camera is Good.. Battery Ultimate... Speaker KK... Mobile Design Super... Display Nice..."
    ],
    "92": [
        "OK for 15000 , good display and battery"
    ],
    "93": [
        "Worst camera and worst performance.... Not at all handy... Better to get samsung A14 instead of cheap Mi phones..."
    ],
    "94": [
        "Very good"
    ],
    "95": [
        "Nice"
    ],
    "96": [
        "Battery backup not good"
    ],
    "97": [
        "Good 👍"
    ],
    "98": [
        "Nice"
    ],
    "99": [
        "Excellent product"
    ],
    "100": [
        "Best mobile"
    ]
}